HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxSbcu_regdef.h
/** \\brief  SBCU Debug Trapped Address Register */
typedef struct _Ifx_SBCU_DBADRT_Bits
{
    unsigned int FPIADR:32;                 /**< \brief [31:0] FPI Bus Address Status (rh) */
} Ifx_SBCU_DBADRT_Bits;

/** \\brief  SBCU Debug Bus Operation Signals Register */
typedef struct _Ifx_SBCU_DBBOS_Bits
{
    unsigned int OPC:4;                     /**< \brief [3:0] Opcode for Signal Status Debug Trigger (rw) */
    unsigned int SVM:1;                     /**< \brief [4:4] SVM Signal for Status Debug Trigger (rw) */
    unsigned int reserved_5:3;              /**< \brief \internal Reserved */
    unsigned int WR:1;                      /**< \brief [8:8] Write Signal for Status Debug Trigger (rw) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int RD:1;                      /**< \brief [12:12] Write Signal for Status Debug Trigger (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBBOS_Bits;

/** \\brief  SBCU Debug Trapped Bus Operation Signals Register */
typedef struct _Ifx_SBCU_DBBOST_Bits
{
    unsigned int FPIOPC:4;                  /**< \brief [3:0] FPI Bus Opcode Status (rh) */
    unsigned int FPISVM:1;                  /**< \brief [4:4] FPI Bus Supervisor Mode Status (rh) */
    unsigned int FPIACK:2;                  /**< \brief [6:5] FPI Bus Acknowledge Status (rh) */
    unsigned int FPIRDY:1;                  /**< \brief [7:7] FPI Bus Ready Status (rh) */
    unsigned int FPIWR:1;                   /**< \brief [8:8] FPI Bus Write Indication Status (rh) */
    unsigned int FPIRST:2;                  /**< \brief [10:9] FPI Bus Reset Status (rh) */
    unsigned int FPIOPS:1;                  /**< \brief [11:11] FPI Bus OCDS Suspend Status (rh) */
    unsigned int FPIRD:1;                   /**< \brief [12:12] FPI Bus Read Indication Status (rh) */
    unsigned int FPIABORT:1;                /**< \brief [13:13] FPI Bus Abort Status (rh) */
    unsigned int FPITOUT:1;                 /**< \brief [14:14] FPI Bus Time-out Status (rh) */
    unsigned int ENDINIT:1;                 /**< \brief [15:15] FPI Bus Endinit Status (rh) */
    unsigned int FPITAG:6;                  /**< \brief [21:16] FPI Bus Master TAG Status (rh) */
    unsigned int reserved_22:10;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBBOST_Bits;

/** \\brief  SBCU Debug Control Register */
typedef struct _Ifx_SBCU_DBCNTL_Bits
{
    unsigned int EO:1;                      /**< \brief [0:0] Status of SBCU Debug Support Enable (r) */
    unsigned int OA:1;                      /**< \brief [1:1] Status of SBCU Breakpoint Logic (r) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int RA:1;                      /**< \brief [4:4] Rearm SBCU Breakpoint Logic (w) */
    unsigned int reserved_5:7;              /**< \brief \internal Reserved */
    unsigned int CONCOM0:1;                 /**< \brief [12:12] Grant and Address Trigger Relation (rw) */
    unsigned int CONCOM1:1;                 /**< \brief [13:13] Address 1 and Address 2 Trigger Relation (rw) */
    unsigned int CONCOM2:1;                 /**< \brief [14:14] Address and Signal Trigger Relation (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int ONG:1;                     /**< \brief [16:16] Grant Trigger Enable (rw) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int ONA1:2;                    /**< \brief [21:20] Address 1 Trigger Control (rw) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int ONA2:2;                    /**< \brief [25:24] Address 2 Trigger Control (rw) */
    unsigned int reserved_26:2;             /**< \brief \internal Reserved */
    unsigned int ONBOS0:1;                  /**< \brief [28:28] Opcode Signal Status Trigger Condition (rw) */
    unsigned int ONBOS1:1;                  /**< \brief [29:29] Supervisor Mode Signal Trigger Condition (rw) */
    unsigned int ONBOS2:1;                  /**< \brief [30:30] Write Signal Trigger Condition (rw) */
    unsigned int ONBOS3:1;                  /**< \brief [31:31] Read Signal Trigger Condition (rw) */
} Ifx_SBCU_DBCNTL_Bits;

/** \\brief  SBCU Debug Data Status Register */
typedef struct _Ifx_SBCU_DBDAT_Bits
{
    unsigned int FPIDATA:32;                /**< \brief [31:0] FPI Bus Data Status (rh) */
} Ifx_SBCU_DBDAT_Bits;

/** \\brief  SBCU Debug Trapped Master Register */
typedef struct _Ifx_SBCU_DBGNTT_Bits
{
    unsigned int DMAH:1;                    /**< \brief [0:0] High-Priority DMA FPI Bus Master Status (rw) */
    unsigned int ONE0:1;                    /**< \brief [1:1] Reserved (rw) */
    unsigned int ETH:1;                     /**< \brief [2:2] Ethernet FPI Bus Master Status (rw) */
    unsigned int HSSL:1;                    /**< \brief [3:3] HSSL FPI Bus Master Status (rw) */
    unsigned int ONE1:1;                    /**< \brief [4:4] Reserved (rw) */
    unsigned int DMAM:1;                    /**< \brief [5:5] Medium-Priority DMA FPI Bus Master Status (rw) */
    unsigned int ONE2:1;                    /**< \brief [6:6] Reserved (rw) */
    unsigned int CPU0:1;                    /**< \brief [7:7] CPU0 FPI Bus Master Status (rw) */
    unsigned int CPU1:1;                    /**< \brief [8:8] CPU1 FPI Bus Master Status (rw) */
    unsigned int CPU2:1;                    /**< \brief [9:9] CPU2 Grant Trigger Enable (rw) */
    unsigned int ONE3:2;                    /**< \brief [11:10] Reserved (rw) */
    unsigned int HSMRMI:1;                  /**< \brief [12:12] HSM Register FPI Bus Master Interface Status (rw) */
    unsigned int HSMCMI:1;                  /**< \brief [13:13] HSM Cache FPI Bus Master Interface Status (rw) */
    unsigned int ONE4:1;                    /**< \brief [14:14] Reserved (rw) */
    unsigned int DMAL:1;                    /**< \brief [15:15] Low-Priority DMA FPI Bus Master Status (rw) */
    unsigned int DMACHNR:8;                 /**< \brief [23:16] DMA-FPI Channel Grant Status (rw) */
    unsigned int ONE5:8;                    /**< \brief [31:24] Reserved (rw) */
} Ifx_SBCU_DBGNTT_Bits;

/** \\brief  SBCU Debug Grant Mask Register */
typedef struct _Ifx_SBCU_DBGRNT_Bits
{
    unsigned int DMAH:1;                    /**< \brief [0:0] DMA High Priority Trigger Enable (rw) */
    unsigned int ONE0:1;                    /**< \brief [1:1] Reserved (rw) */
    unsigned int ETH:1;                     /**< \brief [2:2] Ethernet Trigger Enable (rw) */
    unsigned int HSSL:1;                    /**< \brief [3:3] HSSL Trigger Enable (rw) */
    unsigned int ONE1:1;                    /**< \brief [4:4] Reserved (rw) */
    unsigned int DMAM:1;                    /**< \brief [5:5] DMA Grant Trigger Enable, Medium Priority (rw) */
    unsigned int ONE2:1;                    /**< \brief [6:6] Reserved (rw) */
    unsigned int CPU0:1;                    /**< \brief [7:7] CPU0 Grant Trigger Enable (rw) */
    unsigned int CPU1:1;                    /**< \brief [8:8] CPU1 Grant Trigger Enable (rw) */
    unsigned int CPU2:1;                    /**< \brief [9:9] CPU2 Grant Trigger Enable (rw) */
    unsigned int ONE3:2;                    /**< \brief [11:10] Reserved (rw) */
    unsigned int HSMRMI:1;                  /**< \brief [12:12] HSM Register Master Interface Grant Trigger Enable (rw) */
    unsigned int HSMCMI:1;                  /**< \brief [13:13] HSM Cache Master Interface Grant Trigger Enable (rw) */
    unsigned int ONE4:1;                    /**< \brief [14:14] Reserved (rw) */
    unsigned int DMAL:1;                    /**< \brief [15:15] DMA Grant Trigger Enable, Low Priority (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SBCU_DBGRNT_Bits;

/** \\brief  SBCU Error Address Capture Register */
typedef struct _Ifx_SBCU_EADD_Bits
{
    unsigned int FPIADR:32;                 /**< \brief [31:0] Captured FPI Bus Address (rwh) */
} Ifx_SBCU_EADD_Bits;

/** \\brief  SBCU Error Control Capture Register */
typedef struct _Ifx_SBCU_ECON_Bits
{
    unsigned int ERRCNT:14;                 /**< \brief [13:0] FPI Bus Error Counter (rwh) */
    unsigned int TOUT:1;                    /**< \brief [14:14] State of FPI Bus Time-Out Signal (rwh) */
    unsigned int RDY:1;                     /**< \brief [15:15] State of FPI Bus Ready Signal (rwh) */
    unsigned int ABT:1;                     /**< \brief [16:16] State of FPI Bus Abort Signal (rwh) */
    unsigned int ACK:2;                     /**< \brief [18:17] State of FPI Bus Acknowledge Signals (rwh) */
    unsigned int SVM:1;                     /**< \brief [19:19] State of FPI Bus Supervisor Mode Signal (rwh) */
    unsigned int WRN:1;                     /**< \brief [20:20] State of FPI Bus Write Signal (rwh) */
    unsigned int RDN:1;                     /**< \brief [21:21] State of FPI Bus Read Signal (rwh) */
    unsigned int TAG:6;                     /**< \brief [27:22] FPI Bus Master Tag Number Signals (rwh) */
    unsigned int OPC:4;                     /**< \brief [31:28] FPI Bus Operation Code Signals (rwh) */
} Ifx_SBCU_ECON_Bits;

/** \\brief  SBCU Error Data Capture Register */
typedef struct _Ifx_SBCU_EDAT_Bits
{
    unsigned int FPIDAT:32;                 /**< \brief [31:0] Captured FPI Bus Data (rwh) */
} Ifx_SBCU_EDAT_Bits;

/** \\brief  Module Identification Register */
typedef struct _Ifx_SBCU_ID_Bits
{
    unsigned int MOD_REV:8;                 /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_SBCU_ID_Bits;

